{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pyspark import SparkContext, SparkConf\n",
    "from pyspark.sql import SparkSession, HiveContext\n",
    "from pyspark.sql.functions import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from IPython.display import display\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from PySPARQL.Wrapper import PySPARQLWrapper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import timeit\n",
    "import warnings\n",
    "warnings.filterwarnings('ignore')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connection to Apache Spark"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "spark = (SparkSession\n",
    "          .builder\n",
    "          .appName(\"interfacing spark sql to hive metastore without configuration file\")\n",
    "          .config(\"hive.metastore.uris\", \"thrift://hive-metastore:9083\") \n",
    "          .enableHiveSupport() \n",
    "          .getOrCreate())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### SPARQL query endpoint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql_endpoint = \"http://ontop:8080/sparql\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Timeit configuration"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "repeat = 10\n",
    "loop = 1\n",
    "\n",
    "def Average(lst):\n",
    "    total = 0\n",
    "    for ele in range(0, len(lst)):\n",
    "        total = total + lst[ele]\n",
    "    return total / len(lst)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.9698936240001785, 1.776905861999694, 1.6356732259991986, 1.2230020500001046, 1.3031294909997087, 1.8124921300004644, 1.3802593139998862, 1.3958868429999711, 1.5133209960004024, 1.4760353740002756]\n",
      "\n",
      "AVG_TIME\n",
      "1.5486598909999885\n"
     ]
    }
   ],
   "source": [
    "# Get execution times\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?label ?value\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:productPropertyNumeric1 ?value .\n",
    "            ?product rdf:type bsbm:Product .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?producer rdf:type bsbm:Producer .\n",
    "            ?producer foaf:homepage ?hp .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?review rev:reviewer ?pers .\n",
    "            ?pers foaf:name ?fn .\n",
    "            ?pers edm:country ?cn .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer rdf:type schema:Offer .\n",
    "            FILTER (?value > 102)\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>label</th>\n",
       "      <th>value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>'ahchoo'</td>\n",
       "      <td>594</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>'coterie'</td>\n",
       "      <td>1891</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>'desolates waging reveilles'</td>\n",
       "      <td>374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>'lignites rallying specters'</td>\n",
       "      <td>133</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>'manner gatemen'</td>\n",
       "      <td>831</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>1504</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>'reexhibit wrang tarts'</td>\n",
       "      <td>940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>'resettling uncoagulated lowish'</td>\n",
       "      <td>1743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>'tither pettiness'</td>\n",
       "      <td>1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>'vacillator mortifying'</td>\n",
       "      <td>834</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                              label value\n",
       "0                          'ahchoo'   594\n",
       "1                         'coterie'  1891\n",
       "2      'desolates waging reveilles'   374\n",
       "3      'lignites rallying specters'   133\n",
       "4                  'manner gatemen'   831\n",
       "5  'procreators taiwanese antigene'  1504\n",
       "6           'reexhibit wrang tarts'   940\n",
       "7  'resettling uncoagulated lowish'  1743\n",
       "8                'tither pettiness'  1900\n",
       "9           'vacillator mortifying'   834"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?label ?value\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:productPropertyNumeric1 ?value .\n",
    "            ?product rdf:type bsbm:Product .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?producer rdf:type bsbm:Producer .\n",
    "            ?producer foaf:homepage ?hp .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?review rev:reviewer ?pers .\n",
    "            ?pers foaf:name ?fn .\n",
    "            ?pers edm:country ?cn .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer rdf:type schema:Offer .\n",
    "            FILTER (?value > 102)\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "# Visual plot\n",
    "pandasDF = resultDF.toPandas()\n",
    "display(pandasDF)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[2.6481286369998998, 2.013073076999717, 1.3909098190006262, 1.7910241549998318, 1.4756068000006053, 1.5118295810007112, 2.581986535999931, 1.5044501989996206, 1.2923217909992673, 1.2762878249995993]\n",
      "\n",
      "AVG_TIME\n",
      "1.7485618419999809\n"
     ]
    }
   ],
   "source": [
    "# Get execution times\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?label ?comment ?producer ?price\n",
    "            ?propertyTextual1 ?propertyTextual2 ?propertyTextual3\n",
    "            ?propertyNumeric1 ?propertyNumeric2 ?propertyTextual4\n",
    "            ?propertyTextual5 ?propertyNumeric4\n",
    "        WHERE {\n",
    "            ?p rdfs:label ?label .\n",
    "            ?p rdfs:comment ?comment .\n",
    "            ?p bsbm:producer ?producer .\n",
    "            ?p dc:publisher ?ps .\n",
    "            ?offer bsbm:product ?p .\n",
    "            ?offer bsbm:price ?price .\n",
    "            ?p bsbm:productPropertyTextual1 ?propertyTextual1 .\n",
    "            ?p bsbm:productPropertyTextual2 ?propertyTextual2 .\n",
    "            ?p bsbm:productPropertyTextual3 ?propertyTextual3 .\n",
    "            ?p bsbm:productPropertyNumeric1 ?propertyNumeric1 .\n",
    "            ?p bsbm:productPropertyNumeric2 ?propertyNumeric2 .\n",
    "            ?p bsbm:productPropertyTextual4 ?propertyTextual4 .\n",
    "            ?p bsbm:productPropertyTextual5 ?propertyTextual5 .\n",
    "            ?p bsbm:productPropertyNumeric4 ?propertyNumeric4 .\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>label</th>\n",
       "      <th>comment</th>\n",
       "      <th>producer</th>\n",
       "      <th>price</th>\n",
       "      <th>propertyTextual1</th>\n",
       "      <th>propertyTextual2</th>\n",
       "      <th>propertyTextual3</th>\n",
       "      <th>propertyNumeric1</th>\n",
       "      <th>propertyNumeric2</th>\n",
       "      <th>propertyTextual4</th>\n",
       "      <th>propertyTextual5</th>\n",
       "      <th>propertyNumeric4</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>'ahchoo'</td>\n",
       "      <td>'chanceman ventrals phlegmy vower matureness f...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>8.56176E3</td>\n",
       "      <td>'whirs radiation overman violative adulators b...</td>\n",
       "      <td>'vichies resituates breads visard unfought adj...</td>\n",
       "      <td>'unreels voicer acidifiers shredding fistula u...</td>\n",
       "      <td>594</td>\n",
       "      <td>434</td>\n",
       "      <td>null</td>\n",
       "      <td>'hyperbolas knouted eulogists'</td>\n",
       "      <td>-1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>'ahchoo'</td>\n",
       "      <td>'chanceman ventrals phlegmy vower matureness f...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>3.03146E3</td>\n",
       "      <td>'whirs radiation overman violative adulators b...</td>\n",
       "      <td>'vichies resituates breads visard unfought adj...</td>\n",
       "      <td>'unreels voicer acidifiers shredding fistula u...</td>\n",
       "      <td>594</td>\n",
       "      <td>434</td>\n",
       "      <td>null</td>\n",
       "      <td>'hyperbolas knouted eulogists'</td>\n",
       "      <td>-1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>'vacillator mortifying'</td>\n",
       "      <td>'workaholics situating repartees mobilizers an...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>8.35118E3</td>\n",
       "      <td>'egoisms welterweight friendship topsoiling se...</td>\n",
       "      <td>'unacceptance antibody reinflamed rehardens'</td>\n",
       "      <td>'steeper aerifies unum overbalanced discipline...</td>\n",
       "      <td>834</td>\n",
       "      <td>450</td>\n",
       "      <td>null</td>\n",
       "      <td>null</td>\n",
       "      <td>202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>'desolates waging reveilles'</td>\n",
       "      <td>'poleward sagest impellers enjoyed tailpipes r...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>9.54292E3</td>\n",
       "      <td>'catarrhs triadisms foreseen wennier scurviest...</td>\n",
       "      <td>'chilblains intertribal balsamic exotism reint...</td>\n",
       "      <td>'digged glockenspiels hearted sapid weeny coll...</td>\n",
       "      <td>374</td>\n",
       "      <td>536</td>\n",
       "      <td>'limeades iterances expressionist sculked supp...</td>\n",
       "      <td>null</td>\n",
       "      <td>813</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>'tither pettiness'</td>\n",
       "      <td>'buskin recompensable capacitances bootee lock...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>7.09958E3</td>\n",
       "      <td>'solidest incarnation arrayers gruelingly hono...</td>\n",
       "      <td>'builders preadjusting cpl fosterage trulls fa...</td>\n",
       "      <td>'dermatologies flopover noctambulation frizzle...</td>\n",
       "      <td>1900</td>\n",
       "      <td>774</td>\n",
       "      <td>null</td>\n",
       "      <td>null</td>\n",
       "      <td>-1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>195</th>\n",
       "      <td>'reexhibit wrang tarts'</td>\n",
       "      <td>'bihourly prosiest matrixes jaggedest violinis...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>7.63992E3</td>\n",
       "      <td>'skinfuls uncertainty craving incas maenades f...</td>\n",
       "      <td>'quartered mishmosh booms globoid syndicating ...</td>\n",
       "      <td>'visas deprecatingly conceptualist reactivatio...</td>\n",
       "      <td>940</td>\n",
       "      <td>290</td>\n",
       "      <td>null</td>\n",
       "      <td>null</td>\n",
       "      <td>-1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>196</th>\n",
       "      <td>'tither pettiness'</td>\n",
       "      <td>'buskin recompensable capacitances bootee lock...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>9.20969E3</td>\n",
       "      <td>'solidest incarnation arrayers gruelingly hono...</td>\n",
       "      <td>'builders preadjusting cpl fosterage trulls fa...</td>\n",
       "      <td>'dermatologies flopover noctambulation frizzle...</td>\n",
       "      <td>1900</td>\n",
       "      <td>774</td>\n",
       "      <td>null</td>\n",
       "      <td>null</td>\n",
       "      <td>-1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>197</th>\n",
       "      <td>'resettling uncoagulated lowish'</td>\n",
       "      <td>'reprice renovating chevrolets refolds fantast...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>2.06776E3</td>\n",
       "      <td>'unrestored kneeler chaplet newts deckle vegas...</td>\n",
       "      <td>'replicates corks cinematheques charmers licit...</td>\n",
       "      <td>'cowiest crimpers unmuzzles repacify poilu'</td>\n",
       "      <td>1743</td>\n",
       "      <td>136</td>\n",
       "      <td>null</td>\n",
       "      <td>null</td>\n",
       "      <td>-1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>198</th>\n",
       "      <td>'manner gatemen'</td>\n",
       "      <td>'lordlings dialyzed hoardings palmitate resist...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>1.49017E3</td>\n",
       "      <td>'guzzling jillion psychotherapists substantiat...</td>\n",
       "      <td>'recommendation embezzler reconviction misprop...</td>\n",
       "      <td>'decentralizations impacting promulgations bib...</td>\n",
       "      <td>831</td>\n",
       "      <td>312</td>\n",
       "      <td>'distracts universally trashily enervator'</td>\n",
       "      <td>null</td>\n",
       "      <td>-1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>199</th>\n",
       "      <td>'vacillator mortifying'</td>\n",
       "      <td>'workaholics situating repartees mobilizers an...</td>\n",
       "      <td>http://example.com/Producer/1</td>\n",
       "      <td>4.24145E3</td>\n",
       "      <td>'egoisms welterweight friendship topsoiling se...</td>\n",
       "      <td>'unacceptance antibody reinflamed rehardens'</td>\n",
       "      <td>'steeper aerifies unum overbalanced discipline...</td>\n",
       "      <td>834</td>\n",
       "      <td>450</td>\n",
       "      <td>null</td>\n",
       "      <td>null</td>\n",
       "      <td>202</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>200 rows × 12 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                label  \\\n",
       "0                            'ahchoo'   \n",
       "1                            'ahchoo'   \n",
       "2             'vacillator mortifying'   \n",
       "3        'desolates waging reveilles'   \n",
       "4                  'tither pettiness'   \n",
       "..                                ...   \n",
       "195           'reexhibit wrang tarts'   \n",
       "196                'tither pettiness'   \n",
       "197  'resettling uncoagulated lowish'   \n",
       "198                  'manner gatemen'   \n",
       "199           'vacillator mortifying'   \n",
       "\n",
       "                                               comment  \\\n",
       "0    'chanceman ventrals phlegmy vower matureness f...   \n",
       "1    'chanceman ventrals phlegmy vower matureness f...   \n",
       "2    'workaholics situating repartees mobilizers an...   \n",
       "3    'poleward sagest impellers enjoyed tailpipes r...   \n",
       "4    'buskin recompensable capacitances bootee lock...   \n",
       "..                                                 ...   \n",
       "195  'bihourly prosiest matrixes jaggedest violinis...   \n",
       "196  'buskin recompensable capacitances bootee lock...   \n",
       "197  'reprice renovating chevrolets refolds fantast...   \n",
       "198  'lordlings dialyzed hoardings palmitate resist...   \n",
       "199  'workaholics situating repartees mobilizers an...   \n",
       "\n",
       "                          producer      price  \\\n",
       "0    http://example.com/Producer/1  8.56176E3   \n",
       "1    http://example.com/Producer/1  3.03146E3   \n",
       "2    http://example.com/Producer/1  8.35118E3   \n",
       "3    http://example.com/Producer/1  9.54292E3   \n",
       "4    http://example.com/Producer/1  7.09958E3   \n",
       "..                             ...        ...   \n",
       "195  http://example.com/Producer/1  7.63992E3   \n",
       "196  http://example.com/Producer/1  9.20969E3   \n",
       "197  http://example.com/Producer/1  2.06776E3   \n",
       "198  http://example.com/Producer/1  1.49017E3   \n",
       "199  http://example.com/Producer/1  4.24145E3   \n",
       "\n",
       "                                      propertyTextual1  \\\n",
       "0    'whirs radiation overman violative adulators b...   \n",
       "1    'whirs radiation overman violative adulators b...   \n",
       "2    'egoisms welterweight friendship topsoiling se...   \n",
       "3    'catarrhs triadisms foreseen wennier scurviest...   \n",
       "4    'solidest incarnation arrayers gruelingly hono...   \n",
       "..                                                 ...   \n",
       "195  'skinfuls uncertainty craving incas maenades f...   \n",
       "196  'solidest incarnation arrayers gruelingly hono...   \n",
       "197  'unrestored kneeler chaplet newts deckle vegas...   \n",
       "198  'guzzling jillion psychotherapists substantiat...   \n",
       "199  'egoisms welterweight friendship topsoiling se...   \n",
       "\n",
       "                                      propertyTextual2  \\\n",
       "0    'vichies resituates breads visard unfought adj...   \n",
       "1    'vichies resituates breads visard unfought adj...   \n",
       "2         'unacceptance antibody reinflamed rehardens'   \n",
       "3    'chilblains intertribal balsamic exotism reint...   \n",
       "4    'builders preadjusting cpl fosterage trulls fa...   \n",
       "..                                                 ...   \n",
       "195  'quartered mishmosh booms globoid syndicating ...   \n",
       "196  'builders preadjusting cpl fosterage trulls fa...   \n",
       "197  'replicates corks cinematheques charmers licit...   \n",
       "198  'recommendation embezzler reconviction misprop...   \n",
       "199       'unacceptance antibody reinflamed rehardens'   \n",
       "\n",
       "                                      propertyTextual3 propertyNumeric1  \\\n",
       "0    'unreels voicer acidifiers shredding fistula u...              594   \n",
       "1    'unreels voicer acidifiers shredding fistula u...              594   \n",
       "2    'steeper aerifies unum overbalanced discipline...              834   \n",
       "3    'digged glockenspiels hearted sapid weeny coll...              374   \n",
       "4    'dermatologies flopover noctambulation frizzle...             1900   \n",
       "..                                                 ...              ...   \n",
       "195  'visas deprecatingly conceptualist reactivatio...              940   \n",
       "196  'dermatologies flopover noctambulation frizzle...             1900   \n",
       "197        'cowiest crimpers unmuzzles repacify poilu'             1743   \n",
       "198  'decentralizations impacting promulgations bib...              831   \n",
       "199  'steeper aerifies unum overbalanced discipline...              834   \n",
       "\n",
       "    propertyNumeric2                                   propertyTextual4  \\\n",
       "0                434                                               null   \n",
       "1                434                                               null   \n",
       "2                450                                               null   \n",
       "3                536  'limeades iterances expressionist sculked supp...   \n",
       "4                774                                               null   \n",
       "..               ...                                                ...   \n",
       "195              290                                               null   \n",
       "196              774                                               null   \n",
       "197              136                                               null   \n",
       "198              312         'distracts universally trashily enervator'   \n",
       "199              450                                               null   \n",
       "\n",
       "                   propertyTextual5 propertyNumeric4  \n",
       "0    'hyperbolas knouted eulogists'               -1  \n",
       "1    'hyperbolas knouted eulogists'               -1  \n",
       "2                              null              202  \n",
       "3                              null              813  \n",
       "4                              null               -1  \n",
       "..                              ...              ...  \n",
       "195                            null               -1  \n",
       "196                            null               -1  \n",
       "197                            null               -1  \n",
       "198                            null               -1  \n",
       "199                            null              202  \n",
       "\n",
       "[200 rows x 12 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?label ?comment ?producer ?price\n",
    "            ?propertyTextual1 ?propertyTextual2 ?propertyTextual3\n",
    "            ?propertyNumeric1 ?propertyNumeric2 ?propertyTextual4\n",
    "            ?propertyTextual5 ?propertyNumeric4\n",
    "        WHERE {\n",
    "            ?p rdfs:label ?label .\n",
    "            ?p rdfs:comment ?comment .\n",
    "            ?p bsbm:producer ?producer .\n",
    "            ?p dc:publisher ?ps .\n",
    "            ?offer bsbm:product ?p .\n",
    "            ?offer bsbm:price ?price .\n",
    "            ?p bsbm:productPropertyTextual1 ?propertyTextual1 .\n",
    "            ?p bsbm:productPropertyTextual2 ?propertyTextual2 .\n",
    "            ?p bsbm:productPropertyTextual3 ?propertyTextual3 .\n",
    "            ?p bsbm:productPropertyNumeric1 ?propertyNumeric1 .\n",
    "            ?p bsbm:productPropertyNumeric2 ?propertyNumeric2 .\n",
    "            ?p bsbm:productPropertyTextual4 ?propertyTextual4 .\n",
    "            ?p bsbm:productPropertyTextual5 ?propertyTextual5 .\n",
    "            ?p bsbm:productPropertyNumeric4 ?propertyNumeric4 .\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "# Visual plot\n",
    "pandasDF = resultDF.toPandas()\n",
    "display(pandasDF)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.27481309399991, 0.6865023899999869, 0.8077077090001694, 1.0947284320000108, 1.0224303380000492, 0.9940615169998637, 0.8249554069998339, 0.8511201930004972, 0.8374584960001812, 0.7681802589995641]\n",
      "\n",
      "AVG_TIME\n",
      "0.9161957835000066\n"
     ]
    }
   ],
   "source": [
    "# Get execution times\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?product ?label ?p1 ?p3\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?product bsbm:productPropertyNumeric1 ?p1 .\n",
    "            ?product bsbm:productPropertyNumeric3 ?p3 .\n",
    "            FILTER (?p1 > 1800)\n",
    "            FILTER (?p3 < 5 )\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>product</th>\n",
       "      <th>label</th>\n",
       "      <th>p1</th>\n",
       "      <th>p3</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [product, label, p1, p3]\n",
       "Index: []"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?product ?label ?p1 ?p3\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?product bsbm:productPropertyNumeric1 ?p1 .\n",
    "            ?product bsbm:productPropertyNumeric3 ?p3 .\n",
    "            FILTER (?p1 > 1800)\n",
    "            FILTER (?p3 < 5 )\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "# Visual plot\n",
    "pandasDF = resultDF.toPandas()\n",
    "display(pandasDF)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.3783949899998333, 1.5600478980004482, 1.270196228999339, 1.571367683999597, 1.4738308010000765, 0.9898938100004671, 1.1092333090000466, 1.1712226170002396, 1.0478586429999268, 1.1309514750000744]\n",
      "\n",
      "AVG_TIME\n",
      "1.270299745600005\n"
     ]
    }
   ],
   "source": [
    "# Get execution times\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?label ?c ?propertyTextual ?p1\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:producer ?pcr .\n",
    "            ?pcr edm:country ?c .\n",
    "            ?pcr foaf:homepage ?h .\n",
    "            ?offer gr:validFrom ?vf .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rev:reviewer ?pers .\n",
    "            ?pers foaf:name ?fn .\n",
    "            ?pers edm:country ?cn .\n",
    "            ?product bsbm:productPropertyTextual1 ?propertyTextual .\n",
    "            ?product bsbm:productPropertyNumeric1 ?p1 .\n",
    "            FILTER (?p1 > 630)\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>label</th>\n",
       "      <th>c</th>\n",
       "      <th>propertyTextual</th>\n",
       "      <th>p1</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>'coterie'</td>\n",
       "      <td>DE</td>\n",
       "      <td>'scalded decoct practitioners infolds levered ...</td>\n",
       "      <td>1891</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>'manner gatemen'</td>\n",
       "      <td>DE</td>\n",
       "      <td>'guzzling jillion psychotherapists substantiat...</td>\n",
       "      <td>831</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>DE</td>\n",
       "      <td>'exceptionally replan aiming bedstraws tragica...</td>\n",
       "      <td>1504</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>'reexhibit wrang tarts'</td>\n",
       "      <td>DE</td>\n",
       "      <td>'skinfuls uncertainty craving incas maenades f...</td>\n",
       "      <td>940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>'resettling uncoagulated lowish'</td>\n",
       "      <td>DE</td>\n",
       "      <td>'unrestored kneeler chaplet newts deckle vegas...</td>\n",
       "      <td>1743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>'tither pettiness'</td>\n",
       "      <td>DE</td>\n",
       "      <td>'solidest incarnation arrayers gruelingly hono...</td>\n",
       "      <td>1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>'vacillator mortifying'</td>\n",
       "      <td>DE</td>\n",
       "      <td>'egoisms welterweight friendship topsoiling se...</td>\n",
       "      <td>834</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                              label   c  \\\n",
       "0                         'coterie'  DE   \n",
       "1                  'manner gatemen'  DE   \n",
       "2  'procreators taiwanese antigene'  DE   \n",
       "3           'reexhibit wrang tarts'  DE   \n",
       "4  'resettling uncoagulated lowish'  DE   \n",
       "5                'tither pettiness'  DE   \n",
       "6           'vacillator mortifying'  DE   \n",
       "\n",
       "                                     propertyTextual    p1  \n",
       "0  'scalded decoct practitioners infolds levered ...  1891  \n",
       "1  'guzzling jillion psychotherapists substantiat...   831  \n",
       "2  'exceptionally replan aiming bedstraws tragica...  1504  \n",
       "3  'skinfuls uncertainty craving incas maenades f...   940  \n",
       "4  'unrestored kneeler chaplet newts deckle vegas...  1743  \n",
       "5  'solidest incarnation arrayers gruelingly hono...  1900  \n",
       "6  'egoisms welterweight friendship topsoiling se...   834  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?label ?c ?propertyTextual ?p1\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:producer ?pcr .\n",
    "            ?pcr edm:country ?c .\n",
    "            ?pcr foaf:homepage ?h .\n",
    "            ?offer gr:validFrom ?vf .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rev:reviewer ?pers .\n",
    "            ?pers foaf:name ?fn .\n",
    "            ?pers edm:country ?cn .\n",
    "            ?product bsbm:productPropertyTextual1 ?propertyTextual .\n",
    "            ?product bsbm:productPropertyNumeric1 ?p1 .\n",
    "            FILTER (?p1 > 630)\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "# Visual plot\n",
    "pandasDF = resultDF.toPandas()\n",
    "display(pandasDF)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.2590977930003646, 1.173136956000235, 1.1335630889998356, 1.1543671050003468, 1.1225111929998093, 1.156528384000012, 1.1621529079993707, 1.2123576220001269, 1.293971555999633, 1.3598593779997827]\n",
      "\n",
      "AVG_TIME\n",
      "1.2027545983999517\n"
     ]
    }
   ],
   "source": [
    "# Get execution times\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?productLabel ?simProperty1 ?simProperty2\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?productLabel .\n",
    "            ?product bsbm:productPropertyNumeric1 ?simProperty1 .\n",
    "            ?product bsbm:productPropertyNumeric2 ?simProperty2 .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer rdf:type schema:Offer .\n",
    "            FILTER (?simProperty1 < 120)\n",
    "            FILTER (?productLabel != \"wineskins banded crc\")\n",
    "            FILTER (?simProperty2 < 170)\n",
    "        }\n",
    "        ORDER BY ?productLabel\n",
    "        LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>productLabel</th>\n",
       "      <th>simProperty1</th>\n",
       "      <th>simProperty2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [productLabel, simProperty1, simProperty2]\n",
       "Index: []"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?productLabel ?simProperty1 ?simProperty2\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?productLabel .\n",
    "            ?product bsbm:productPropertyNumeric1 ?simProperty1 .\n",
    "            ?product bsbm:productPropertyNumeric2 ?simProperty2 .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer rdf:type schema:Offer .\n",
    "            FILTER (?simProperty1 < 120)\n",
    "            FILTER (?productLabel != \"wineskins banded crc\")\n",
    "            FILTER (?simProperty2 < 170)\n",
    "        }\n",
    "        ORDER BY ?productLabel\n",
    "        LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "# Visual plot\n",
    "pandasDF = resultDF.toPandas()\n",
    "display(pandasDF)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.5266206239994062, 1.4740476220003984, 1.4697140189991842, 1.4501250019993677, 1.4997575239995058, 1.5712831569999253, 1.492969947000347, 1.4701914369998121, 1.4815737540002374, 1.913996013000542]\n",
      "\n",
      "AVG_TIME\n",
      "1.5350279098998727\n"
     ]
    }
   ],
   "source": [
    "# Get execution times\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?productLabel ?price ?vendor ?revTitle\n",
    "        ?reviewer ?rating1 ?rating2 ?product ?revName\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?productLabel .\n",
    "            ?product rdf:type bsbm:Product .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer bsbm:price ?price .\n",
    "            ?offer bsbm:vendor ?vendor .\n",
    "            ?offer bsbm:validTo ?date .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rev:reviewer ?reviewer .\n",
    "            ?review dc:title ?revTitle .\n",
    "            ?review bsbm:rating1 ?rating1 .\n",
    "            ?review bsbm:rating2 ?rating2 .\n",
    "            ?reviewer foaf:name ?revName .\n",
    "            ?reviewer a foaf:Person .\n",
    "            FILTER (?price > 5000)\n",
    "            FILTER (str(?product) = \"http://example.com/Product/9\")\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>productLabel</th>\n",
       "      <th>price</th>\n",
       "      <th>vendor</th>\n",
       "      <th>revTitle</th>\n",
       "      <th>reviewer</th>\n",
       "      <th>rating1</th>\n",
       "      <th>rating2</th>\n",
       "      <th>product</th>\n",
       "      <th>revName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.09271E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'improves pervertedly kevils canneries'</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>7</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>9.23612E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'improves pervertedly kevils canneries'</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>7</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>7.26904E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'slavishness muonic unencumbered horsepox vine...</td>\n",
       "      <td>http://example.com/Person/2</td>\n",
       "      <td>5</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Eyana-Aurelianus'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>9.23612E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'slavishness muonic unencumbered horsepox vine...</td>\n",
       "      <td>http://example.com/Person/2</td>\n",
       "      <td>5</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Eyana-Aurelianus'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>9.23612E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'recharting wardrobes divvies rhetorics phanta...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.72534E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'heehawed underway knickers scroungier hypnoti...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>6.95779E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'footworn forms nonflammable abator editoriali...</td>\n",
       "      <td>http://example.com/Person/5</td>\n",
       "      <td>8</td>\n",
       "      <td>5</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Przemek-Berte'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.72534E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'slavishness muonic unencumbered horsepox vine...</td>\n",
       "      <td>http://example.com/Person/2</td>\n",
       "      <td>5</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Eyana-Aurelianus'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>9.23612E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'footworn forms nonflammable abator editoriali...</td>\n",
       "      <td>http://example.com/Person/5</td>\n",
       "      <td>8</td>\n",
       "      <td>5</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Przemek-Berte'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.72534E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'improves pervertedly kevils canneries'</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>7</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.72534E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'affirmance subagency diptych donne tipoffs ro...</td>\n",
       "      <td>http://example.com/Person/4</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Allegra-Walburga'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>7.26904E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'improves pervertedly kevils canneries'</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>7</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>9.23612E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'affirmance subagency diptych donne tipoffs ro...</td>\n",
       "      <td>http://example.com/Person/4</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Allegra-Walburga'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.09271E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'slavishness muonic unencumbered horsepox vine...</td>\n",
       "      <td>http://example.com/Person/2</td>\n",
       "      <td>5</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Eyana-Aurelianus'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>6.95779E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'affirmance subagency diptych donne tipoffs ro...</td>\n",
       "      <td>http://example.com/Person/4</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Allegra-Walburga'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>6.95779E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'heehawed underway knickers scroungier hypnoti...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.72534E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'recharting wardrobes divvies rhetorics phanta...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>7.26904E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'footworn forms nonflammable abator editoriali...</td>\n",
       "      <td>http://example.com/Person/5</td>\n",
       "      <td>8</td>\n",
       "      <td>5</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Przemek-Berte'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.09271E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'heehawed underway knickers scroungier hypnoti...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>7.26904E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'recharting wardrobes divvies rhetorics phanta...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.09271E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'footworn forms nonflammable abator editoriali...</td>\n",
       "      <td>http://example.com/Person/5</td>\n",
       "      <td>8</td>\n",
       "      <td>5</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Przemek-Berte'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.09271E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'affirmance subagency diptych donne tipoffs ro...</td>\n",
       "      <td>http://example.com/Person/4</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Allegra-Walburga'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>7.26904E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'heehawed underway knickers scroungier hypnoti...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>6.95779E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'recharting wardrobes divvies rhetorics phanta...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>6.95779E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'improves pervertedly kevils canneries'</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>7</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.72534E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'footworn forms nonflammable abator editoriali...</td>\n",
       "      <td>http://example.com/Person/5</td>\n",
       "      <td>8</td>\n",
       "      <td>5</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Przemek-Berte'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>9.23612E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'heehawed underway knickers scroungier hypnoti...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>7.26904E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'affirmance subagency diptych donne tipoffs ro...</td>\n",
       "      <td>http://example.com/Person/4</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Allegra-Walburga'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>6.95779E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'slavishness muonic unencumbered horsepox vine...</td>\n",
       "      <td>http://example.com/Person/2</td>\n",
       "      <td>5</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Eyana-Aurelianus'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>'procreators taiwanese antigene'</td>\n",
       "      <td>8.09271E3</td>\n",
       "      <td>1</td>\n",
       "      <td>'recharting wardrobes divvies rhetorics phanta...</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        productLabel      price vendor  \\\n",
       "0   'procreators taiwanese antigene'  8.09271E3      1   \n",
       "1   'procreators taiwanese antigene'  9.23612E3      1   \n",
       "2   'procreators taiwanese antigene'  7.26904E3      1   \n",
       "3   'procreators taiwanese antigene'  9.23612E3      1   \n",
       "4   'procreators taiwanese antigene'  9.23612E3      1   \n",
       "5   'procreators taiwanese antigene'  8.72534E3      1   \n",
       "6   'procreators taiwanese antigene'  6.95779E3      1   \n",
       "7   'procreators taiwanese antigene'  8.72534E3      1   \n",
       "8   'procreators taiwanese antigene'  9.23612E3      1   \n",
       "9   'procreators taiwanese antigene'  8.72534E3      1   \n",
       "10  'procreators taiwanese antigene'  8.72534E3      1   \n",
       "11  'procreators taiwanese antigene'  7.26904E3      1   \n",
       "12  'procreators taiwanese antigene'  9.23612E3      1   \n",
       "13  'procreators taiwanese antigene'  8.09271E3      1   \n",
       "14  'procreators taiwanese antigene'  6.95779E3      1   \n",
       "15  'procreators taiwanese antigene'  6.95779E3      1   \n",
       "16  'procreators taiwanese antigene'  8.72534E3      1   \n",
       "17  'procreators taiwanese antigene'  7.26904E3      1   \n",
       "18  'procreators taiwanese antigene'  8.09271E3      1   \n",
       "19  'procreators taiwanese antigene'  7.26904E3      1   \n",
       "20  'procreators taiwanese antigene'  8.09271E3      1   \n",
       "21  'procreators taiwanese antigene'  8.09271E3      1   \n",
       "22  'procreators taiwanese antigene'  7.26904E3      1   \n",
       "23  'procreators taiwanese antigene'  6.95779E3      1   \n",
       "24  'procreators taiwanese antigene'  6.95779E3      1   \n",
       "25  'procreators taiwanese antigene'  8.72534E3      1   \n",
       "26  'procreators taiwanese antigene'  9.23612E3      1   \n",
       "27  'procreators taiwanese antigene'  7.26904E3      1   \n",
       "28  'procreators taiwanese antigene'  6.95779E3      1   \n",
       "29  'procreators taiwanese antigene'  8.09271E3      1   \n",
       "\n",
       "                                             revTitle  \\\n",
       "0             'improves pervertedly kevils canneries'   \n",
       "1             'improves pervertedly kevils canneries'   \n",
       "2   'slavishness muonic unencumbered horsepox vine...   \n",
       "3   'slavishness muonic unencumbered horsepox vine...   \n",
       "4   'recharting wardrobes divvies rhetorics phanta...   \n",
       "5   'heehawed underway knickers scroungier hypnoti...   \n",
       "6   'footworn forms nonflammable abator editoriali...   \n",
       "7   'slavishness muonic unencumbered horsepox vine...   \n",
       "8   'footworn forms nonflammable abator editoriali...   \n",
       "9             'improves pervertedly kevils canneries'   \n",
       "10  'affirmance subagency diptych donne tipoffs ro...   \n",
       "11            'improves pervertedly kevils canneries'   \n",
       "12  'affirmance subagency diptych donne tipoffs ro...   \n",
       "13  'slavishness muonic unencumbered horsepox vine...   \n",
       "14  'affirmance subagency diptych donne tipoffs ro...   \n",
       "15  'heehawed underway knickers scroungier hypnoti...   \n",
       "16  'recharting wardrobes divvies rhetorics phanta...   \n",
       "17  'footworn forms nonflammable abator editoriali...   \n",
       "18  'heehawed underway knickers scroungier hypnoti...   \n",
       "19  'recharting wardrobes divvies rhetorics phanta...   \n",
       "20  'footworn forms nonflammable abator editoriali...   \n",
       "21  'affirmance subagency diptych donne tipoffs ro...   \n",
       "22  'heehawed underway knickers scroungier hypnoti...   \n",
       "23  'recharting wardrobes divvies rhetorics phanta...   \n",
       "24            'improves pervertedly kevils canneries'   \n",
       "25  'footworn forms nonflammable abator editoriali...   \n",
       "26  'heehawed underway knickers scroungier hypnoti...   \n",
       "27  'affirmance subagency diptych donne tipoffs ro...   \n",
       "28  'slavishness muonic unencumbered horsepox vine...   \n",
       "29  'recharting wardrobes divvies rhetorics phanta...   \n",
       "\n",
       "                       reviewer rating1 rating2                       product  \\\n",
       "0   http://example.com/Person/3       7      10  http://example.com/Product/9   \n",
       "1   http://example.com/Person/3       7      10  http://example.com/Product/9   \n",
       "2   http://example.com/Person/2       5      10  http://example.com/Product/9   \n",
       "3   http://example.com/Person/2       5      10  http://example.com/Product/9   \n",
       "4   http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "5   http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "6   http://example.com/Person/5       8       5  http://example.com/Product/9   \n",
       "7   http://example.com/Person/2       5      10  http://example.com/Product/9   \n",
       "8   http://example.com/Person/5       8       5  http://example.com/Product/9   \n",
       "9   http://example.com/Person/3       7      10  http://example.com/Product/9   \n",
       "10  http://example.com/Person/4       2       3  http://example.com/Product/9   \n",
       "11  http://example.com/Person/3       7      10  http://example.com/Product/9   \n",
       "12  http://example.com/Person/4       2       3  http://example.com/Product/9   \n",
       "13  http://example.com/Person/2       5      10  http://example.com/Product/9   \n",
       "14  http://example.com/Person/4       2       3  http://example.com/Product/9   \n",
       "15  http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "16  http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "17  http://example.com/Person/5       8       5  http://example.com/Product/9   \n",
       "18  http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "19  http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "20  http://example.com/Person/5       8       5  http://example.com/Product/9   \n",
       "21  http://example.com/Person/4       2       3  http://example.com/Product/9   \n",
       "22  http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "23  http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "24  http://example.com/Person/3       7      10  http://example.com/Product/9   \n",
       "25  http://example.com/Person/5       8       5  http://example.com/Product/9   \n",
       "26  http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "27  http://example.com/Person/4       2       3  http://example.com/Product/9   \n",
       "28  http://example.com/Person/2       5      10  http://example.com/Product/9   \n",
       "29  http://example.com/Person/3      -1       4  http://example.com/Product/9   \n",
       "\n",
       "                 revName  \n",
       "0   'Danijela-Adalbrand'  \n",
       "1   'Danijela-Adalbrand'  \n",
       "2     'Eyana-Aurelianus'  \n",
       "3     'Eyana-Aurelianus'  \n",
       "4   'Danijela-Adalbrand'  \n",
       "5   'Danijela-Adalbrand'  \n",
       "6        'Przemek-Berte'  \n",
       "7     'Eyana-Aurelianus'  \n",
       "8        'Przemek-Berte'  \n",
       "9   'Danijela-Adalbrand'  \n",
       "10    'Allegra-Walburga'  \n",
       "11  'Danijela-Adalbrand'  \n",
       "12    'Allegra-Walburga'  \n",
       "13    'Eyana-Aurelianus'  \n",
       "14    'Allegra-Walburga'  \n",
       "15  'Danijela-Adalbrand'  \n",
       "16  'Danijela-Adalbrand'  \n",
       "17       'Przemek-Berte'  \n",
       "18  'Danijela-Adalbrand'  \n",
       "19  'Danijela-Adalbrand'  \n",
       "20       'Przemek-Berte'  \n",
       "21    'Allegra-Walburga'  \n",
       "22  'Danijela-Adalbrand'  \n",
       "23  'Danijela-Adalbrand'  \n",
       "24  'Danijela-Adalbrand'  \n",
       "25       'Przemek-Berte'  \n",
       "26  'Danijela-Adalbrand'  \n",
       "27    'Allegra-Walburga'  \n",
       "28    'Eyana-Aurelianus'  \n",
       "29  'Danijela-Adalbrand'  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?productLabel ?price ?vendor ?revTitle\n",
    "        ?reviewer ?rating1 ?rating2 ?product ?revName\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?productLabel .\n",
    "            ?product rdf:type bsbm:Product .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer bsbm:price ?price .\n",
    "            ?offer bsbm:vendor ?vendor .\n",
    "            ?offer bsbm:validTo ?date .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rev:reviewer ?reviewer .\n",
    "            ?review dc:title ?revTitle .\n",
    "            ?review bsbm:rating1 ?rating1 .\n",
    "            ?review bsbm:rating2 ?rating2 .\n",
    "            ?reviewer foaf:name ?revName .\n",
    "            ?reviewer a foaf:Person .\n",
    "            FILTER (?price > 5000)\n",
    "            FILTER (str(?product) = \"http://example.com/Product/9\")\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "# Visual plot\n",
    "pandasDF = resultDF.toPandas()\n",
    "display(pandasDF)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q8"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.7959132030000546, 1.7305863510000563, 1.8966450699999768, 1.9551388760000918, 1.8935270570000284, 1.8750050440003179, 1.926615794999634, 2.159048728999551, 1.9835431880001124, 1.8991601660000015]\n",
      "\n",
      "AVG_TIME\n",
      "1.9115183478999824\n"
     ]
    }
   ],
   "source": [
    "# Get execution times\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?title ?text ?reviewDate ?reviewer\n",
    "                        ?reviewerName ?rating1 ?rating2\n",
    "                        ?rating3 ?rating4 ?product\n",
    "        WHERE {\n",
    "            ?product rdfs:label  ?label .\n",
    "            ?product bsbm:productPropertyTextual1 ?pt .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?producer edm:country ?c .\n",
    "            ?producer foaf:homepage ?h .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review dc:title ?title .\n",
    "            ?review rev:text ?text .\n",
    "            ?review bsbm:reviewDate ?reviewDate .\n",
    "            ?review rev:reviewer ?reviewer .\n",
    "            ?review bsbm:rating1 ?rating1 .\n",
    "            ?review bsbm:rating2 ?rating2 .\n",
    "            ?review bsbm:rating3 ?rating3 .\n",
    "            ?review bsbm:rating4 ?rating4 .\n",
    "            ?reviewer foaf:name ?reviewerName .\n",
    "            ?reviewer a foaf:Person .\n",
    "            FILTER (str(?product) = \"http://example.com/Product/9\")\n",
    "        }\n",
    "        ORDER BY DESC(?reviewDate)\n",
    "        LIMIT 9\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>text</th>\n",
       "      <th>reviewDate</th>\n",
       "      <th>reviewer</th>\n",
       "      <th>reviewerName</th>\n",
       "      <th>rating1</th>\n",
       "      <th>rating2</th>\n",
       "      <th>rating3</th>\n",
       "      <th>rating4</th>\n",
       "      <th>product</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>'heehawed underway knickers scroungier hypnoti...</td>\n",
       "      <td>'brisker astrophysicists elations chlorines va...</td>\n",
       "      <td>2008-03-23</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>-1</td>\n",
       "      <td>9</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>'affirmance subagency diptych donne tipoffs ro...</td>\n",
       "      <td>'southwesterners denier bicycles veneers super...</td>\n",
       "      <td>2008-01-16</td>\n",
       "      <td>http://example.com/Person/4</td>\n",
       "      <td>'Allegra-Walburga'</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>10</td>\n",
       "      <td>6</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>'slavishness muonic unencumbered horsepox vine...</td>\n",
       "      <td>'philatelist lugubrious unknots hummocky gonge...</td>\n",
       "      <td>2008-01-14</td>\n",
       "      <td>http://example.com/Person/2</td>\n",
       "      <td>'Eyana-Aurelianus'</td>\n",
       "      <td>5</td>\n",
       "      <td>10</td>\n",
       "      <td>-1</td>\n",
       "      <td>-1</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>'footworn forms nonflammable abator editoriali...</td>\n",
       "      <td>'breedings silences respirating litterateurs e...</td>\n",
       "      <td>2007-12-04</td>\n",
       "      <td>http://example.com/Person/5</td>\n",
       "      <td>'Przemek-Berte'</td>\n",
       "      <td>8</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>'recharting wardrobes divvies rhetorics phanta...</td>\n",
       "      <td>'moxas clangored haughtier rascals southerly s...</td>\n",
       "      <td>2007-11-16</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "      <td>-1</td>\n",
       "      <td>4</td>\n",
       "      <td>7</td>\n",
       "      <td>10</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>'improves pervertedly kevils canneries'</td>\n",
       "      <td>'mapping constructions motiveless stalkier val...</td>\n",
       "      <td>2007-11-16</td>\n",
       "      <td>http://example.com/Person/3</td>\n",
       "      <td>'Danijela-Adalbrand'</td>\n",
       "      <td>7</td>\n",
       "      <td>10</td>\n",
       "      <td>2</td>\n",
       "      <td>8</td>\n",
       "      <td>http://example.com/Product/9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               title  \\\n",
       "0  'heehawed underway knickers scroungier hypnoti...   \n",
       "1  'affirmance subagency diptych donne tipoffs ro...   \n",
       "2  'slavishness muonic unencumbered horsepox vine...   \n",
       "3  'footworn forms nonflammable abator editoriali...   \n",
       "4  'recharting wardrobes divvies rhetorics phanta...   \n",
       "5            'improves pervertedly kevils canneries'   \n",
       "\n",
       "                                                text  reviewDate  \\\n",
       "0  'brisker astrophysicists elations chlorines va...  2008-03-23   \n",
       "1  'southwesterners denier bicycles veneers super...  2008-01-16   \n",
       "2  'philatelist lugubrious unknots hummocky gonge...  2008-01-14   \n",
       "3  'breedings silences respirating litterateurs e...  2007-12-04   \n",
       "4  'moxas clangored haughtier rascals southerly s...  2007-11-16   \n",
       "5  'mapping constructions motiveless stalkier val...  2007-11-16   \n",
       "\n",
       "                      reviewer          reviewerName rating1 rating2 rating3  \\\n",
       "0  http://example.com/Person/3  'Danijela-Adalbrand'      -1       4      -1   \n",
       "1  http://example.com/Person/4    'Allegra-Walburga'       2       3      10   \n",
       "2  http://example.com/Person/2    'Eyana-Aurelianus'       5      10      -1   \n",
       "3  http://example.com/Person/5       'Przemek-Berte'       8       5       2   \n",
       "4  http://example.com/Person/3  'Danijela-Adalbrand'      -1       4       7   \n",
       "5  http://example.com/Person/3  'Danijela-Adalbrand'       7      10       2   \n",
       "\n",
       "  rating4                       product  \n",
       "0       9  http://example.com/Product/9  \n",
       "1       6  http://example.com/Product/9  \n",
       "2      -1  http://example.com/Product/9  \n",
       "3       1  http://example.com/Product/9  \n",
       "4      10  http://example.com/Product/9  \n",
       "5       8  http://example.com/Product/9  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?title ?text ?reviewDate ?reviewer\n",
    "                        ?reviewerName ?rating1 ?rating2\n",
    "                        ?rating3 ?rating4 ?product\n",
    "        WHERE {\n",
    "            ?product rdfs:label  ?label .\n",
    "            ?product bsbm:productPropertyTextual1 ?pt .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?producer edm:country ?c .\n",
    "            ?producer foaf:homepage ?h .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review dc:title ?title .\n",
    "            ?review rev:text ?text .\n",
    "            ?review bsbm:reviewDate ?reviewDate .\n",
    "            ?review rev:reviewer ?reviewer .\n",
    "            ?review bsbm:rating1 ?rating1 .\n",
    "            ?review bsbm:rating2 ?rating2 .\n",
    "            ?review bsbm:rating3 ?rating3 .\n",
    "            ?review bsbm:rating4 ?rating4 .\n",
    "            ?reviewer foaf:name ?reviewerName .\n",
    "            ?reviewer a foaf:Person .\n",
    "            FILTER (str(?product) = \"http://example.com/Product/9\")\n",
    "        }\n",
    "        ORDER BY DESC(?reviewDate)\n",
    "        LIMIT 9\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "# Visual plot\n",
    "pandasDF = resultDF.toPandas()\n",
    "display(pandasDF)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Free ?subj and ?pred"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[15.576336842000273, 12.693113297000309, 12.37595686899931, 12.529332037999666, 12.527171355999599, 13.605895274000432, 12.628288398000223, 12.030420683000557, 12.188646896000137, 12.152942999000516]\n",
      "\n",
      "AVG_TIME\n",
      "12.830810465200102\n"
     ]
    }
   ],
   "source": [
    "# Get execution times\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "        SELECT ?subj ?pred\n",
    "        WHERE {\n",
    "            ?subj ?pred \"1\"^^xsd:int.\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subj</th>\n",
       "      <th>pred</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://example.com/Review/31</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://example.com/Review/65</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://example.com/Review/94</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://example.com/Review/59</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://example.com/Review/10</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>558</th>\n",
       "      <td>http://example.com/Product/4</td>\n",
       "      <td>http://purl.org/dc/elements/1.1/publisher</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>559</th>\n",
       "      <td>http://example.com/Product/8</td>\n",
       "      <td>http://purl.org/dc/elements/1.1/publisher</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>560</th>\n",
       "      <td>http://example.com/Product/7</td>\n",
       "      <td>http://purl.org/dc/elements/1.1/publisher</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>561</th>\n",
       "      <td>http://example.com/Product/10</td>\n",
       "      <td>http://purl.org/dc/elements/1.1/publisher</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>562</th>\n",
       "      <td>http://example.com/Product/2</td>\n",
       "      <td>http://purl.org/dc/elements/1.1/publisher</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>563 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                              subj  \\\n",
       "0     http://example.com/Review/31   \n",
       "1     http://example.com/Review/65   \n",
       "2     http://example.com/Review/94   \n",
       "3     http://example.com/Review/59   \n",
       "4     http://example.com/Review/10   \n",
       "..                             ...   \n",
       "558   http://example.com/Product/4   \n",
       "559   http://example.com/Product/8   \n",
       "560   http://example.com/Product/7   \n",
       "561  http://example.com/Product/10   \n",
       "562   http://example.com/Product/2   \n",
       "\n",
       "                                                  pred  \n",
       "0    http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...  \n",
       "1    http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...  \n",
       "2    http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...  \n",
       "3    http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...  \n",
       "4    http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...  \n",
       "..                                                 ...  \n",
       "558          http://purl.org/dc/elements/1.1/publisher  \n",
       "559          http://purl.org/dc/elements/1.1/publisher  \n",
       "560          http://purl.org/dc/elements/1.1/publisher  \n",
       "561          http://purl.org/dc/elements/1.1/publisher  \n",
       "562          http://purl.org/dc/elements/1.1/publisher  \n",
       "\n",
       "[563 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "        SELECT ?subj ?pred\n",
    "        WHERE {\n",
    "            ?subj ?pred \"1\"^^xsd:int.\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "# Visual plot\n",
    "pandasDF = resultDF.toPandas()\n",
    "display(pandasDF)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Entailment regime query \n",
    "__attention__: usually takes several minutes "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[201.38486229599948]\n"
     ]
    }
   ],
   "source": [
    "# Get execution time (only 1 iteration)\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "    SELECT ?s ?p ?o \n",
    "    WHERE { \n",
    "        ?s ?p ?o \n",
    "    }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=1, globals=globals() , number=1)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "      <th>p</th>\n",
       "      <th>o</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://example.com/Review/43</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "      <td>http://example.com/Product/7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://example.com/Review/92</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "      <td>http://example.com/Product/2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://example.com/Review/59</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "      <td>http://example.com/Product/7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://example.com/Review/16</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "      <td>http://example.com/Product/3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://example.com/Review/34</td>\n",
       "      <td>http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...</td>\n",
       "      <td>http://example.com/Product/5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5086</th>\n",
       "      <td>http://example.com/Product/1</td>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#comment</td>\n",
       "      <td>'lordlings dialyzed hoardings palmitate resist...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5087</th>\n",
       "      <td>http://example.com/Product/10</td>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#comment</td>\n",
       "      <td>'filaree cirque vibrations leukemoid enquirer ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5088</th>\n",
       "      <td>http://example.com/Product/6</td>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#comment</td>\n",
       "      <td>'poleward sagest impellers enjoyed tailpipes r...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5089</th>\n",
       "      <td>http://example.com/Product/2</td>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#comment</td>\n",
       "      <td>'naughtiness illuminating careerers computeres...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5090</th>\n",
       "      <td>http://example.com/Product/4</td>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#comment</td>\n",
       "      <td>'bihourly prosiest matrixes jaggedest violinis...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5091 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  s  \\\n",
       "0      http://example.com/Review/43   \n",
       "1      http://example.com/Review/92   \n",
       "2      http://example.com/Review/59   \n",
       "3      http://example.com/Review/16   \n",
       "4      http://example.com/Review/34   \n",
       "...                             ...   \n",
       "5086   http://example.com/Product/1   \n",
       "5087  http://example.com/Product/10   \n",
       "5088   http://example.com/Product/6   \n",
       "5089   http://example.com/Product/2   \n",
       "5090   http://example.com/Product/4   \n",
       "\n",
       "                                                      p  \\\n",
       "0     http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...   \n",
       "1     http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...   \n",
       "2     http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...   \n",
       "3     http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...   \n",
       "4     http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01...   \n",
       "...                                                 ...   \n",
       "5086       http://www.w3.org/2000/01/rdf-schema#comment   \n",
       "5087       http://www.w3.org/2000/01/rdf-schema#comment   \n",
       "5088       http://www.w3.org/2000/01/rdf-schema#comment   \n",
       "5089       http://www.w3.org/2000/01/rdf-schema#comment   \n",
       "5090       http://www.w3.org/2000/01/rdf-schema#comment   \n",
       "\n",
       "                                                      o  \n",
       "0                          http://example.com/Product/7  \n",
       "1                          http://example.com/Product/2  \n",
       "2                          http://example.com/Product/7  \n",
       "3                          http://example.com/Product/3  \n",
       "4                          http://example.com/Product/5  \n",
       "...                                                 ...  \n",
       "5086  'lordlings dialyzed hoardings palmitate resist...  \n",
       "5087  'filaree cirque vibrations leukemoid enquirer ...  \n",
       "5088  'poleward sagest impellers enjoyed tailpipes r...  \n",
       "5089  'naughtiness illuminating careerers computeres...  \n",
       "5090  'bihourly prosiest matrixes jaggedest violinis...  \n",
       "\n",
       "[5091 rows x 3 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "    SELECT ?s ?p ?o \n",
    "    WHERE { \n",
    "        ?s ?p ?o \n",
    "    }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "# Visual plot\n",
    "pandasDF = resultDF.toPandas()\n",
    "display(pandasDF)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
