{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pyspark import SparkContext, SparkConf\n",
    "from pyspark.sql import SparkSession, HiveContext\n",
    "from pyspark.sql.functions import *\n",
    "import timeit"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [],
   "source": [
    "from PySPARQL.Wrapper import PySPARQLWrapper"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connection to Apache Spark"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {},
   "outputs": [],
   "source": [
    "spark = (SparkSession\n",
    "          .builder\n",
    "          .appName(\"interfacing spark sql to hive metastore without configuration file\")\n",
    "          .config(\"hive.metastore.uris\", \"thrift://hive-metastore:9083\") \n",
    "          .enableHiveSupport() \n",
    "          .getOrCreate())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### SPARQL query endpoint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql_endpoint = \"http://ontop:8080/sparql\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Timeit configuration"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [],
   "source": [
    "repeat = 10\n",
    "loop = 1\n",
    "\n",
    "def Average(lst):\n",
    "    total = 0\n",
    "    for ele in range(0, len(lst)):\n",
    "        total = total + lst[ele]\n",
    "    return total / len(lst)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.4218770640000002, 1.426847763999831, 1.6082297469993136, 1.3164694469996903, 1.2631199130000823, 1.2582888169999933, 1.2783897139997862, 1.2663469479994092, 1.2902684180007782, 1.3214915389999078]\n",
      "\n",
      "AVG_TIME\n",
      "1.3451329370998792\n"
     ]
    }
   ],
   "source": [
    "# Runt the test\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?label ?value\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:productPropertyNumeric1 ?value .\n",
    "            ?product rdf:type bsbm:Product .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?producer rdf:type bsbm:Producer .\n",
    "            ?producer foaf:homepage ?hp .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?review rev:reviewer ?pers .\n",
    "            ?pers foaf:name ?fn .\n",
    "            ?pers edm:country ?cn .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer rdf:type schema:Offer .\n",
    "            FILTER (?value > 102)\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+-----+\n",
      "|               label|value|\n",
      "+--------------------+-----+\n",
      "|            'ahchoo'|  594|\n",
      "|           'coterie'| 1891|\n",
      "|'desolates waging...|  374|\n",
      "|'lignites rallyin...|  133|\n",
      "|    'manner gatemen'|  831|\n",
      "|'procreators taiw...| 1504|\n",
      "|'reexhibit wrang ...|  940|\n",
      "|'resettling uncoa...| 1743|\n",
      "|  'tither pettiness'| 1900|\n",
      "|'vacillator morti...|  834|\n",
      "+--------------------+-----+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?label ?value\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:productPropertyNumeric1 ?value .\n",
    "            ?product rdf:type bsbm:Product .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?producer rdf:type bsbm:Producer .\n",
    "            ?producer foaf:homepage ?hp .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?review rev:reviewer ?pers .\n",
    "            ?pers foaf:name ?fn .\n",
    "            ?pers edm:country ?cn .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer rdf:type schema:Offer .\n",
    "            FILTER (?value > 102)\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "resultDF.show()  # Plot the results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.8792619249998097, 1.939286832000107, 2.178938877999826, 1.7234063119994971, 2.1593382009996276, 1.7946767660005207, 1.8100408649997917, 2.291362152000147, 1.7993365120000817, 1.8837381270004698]\n",
      "\n",
      "AVG_TIME\n",
      "1.945938656999988\n"
     ]
    }
   ],
   "source": [
    "# Runt the test\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?label ?comment ?producer ?price\n",
    "            ?propertyTextual1 ?propertyTextual2 ?propertyTextual3\n",
    "            ?propertyNumeric1 ?propertyNumeric2 ?propertyTextual4\n",
    "            ?propertyTextual5 ?propertyNumeric4\n",
    "        WHERE {\n",
    "            ?p rdfs:label ?label .\n",
    "            ?p rdfs:comment ?comment .\n",
    "            ?p bsbm:producer ?producer .\n",
    "            ?p dc:publisher ?ps .\n",
    "            ?offer bsbm:product ?p .\n",
    "            ?offer bsbm:price ?price .\n",
    "            ?p bsbm:productPropertyTextual1 ?propertyTextual1 .\n",
    "            ?p bsbm:productPropertyTextual2 ?propertyTextual2 .\n",
    "            ?p bsbm:productPropertyTextual3 ?propertyTextual3 .\n",
    "            ?p bsbm:productPropertyNumeric1 ?propertyNumeric1 .\n",
    "            ?p bsbm:productPropertyNumeric2 ?propertyNumeric2 .\n",
    "            ?p bsbm:productPropertyTextual4 ?propertyTextual4 .\n",
    "            ?p bsbm:productPropertyTextual5 ?propertyTextual5 .\n",
    "            ?p bsbm:productPropertyNumeric4 ?propertyNumeric4 .\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+--------------------+--------------------+---------+--------------------+--------------------+--------------------+----------------+----------------+--------------------+--------------------+----------------+\n",
      "|               label|             comment|            producer|    price|    propertyTextual1|    propertyTextual2|    propertyTextual3|propertyNumeric1|propertyNumeric2|    propertyTextual4|    propertyTextual5|propertyNumeric4|\n",
      "+--------------------+--------------------+--------------------+---------+--------------------+--------------------+--------------------+----------------+----------------+--------------------+--------------------+----------------+\n",
      "|            'ahchoo'|'chanceman ventra...|http://example.co...|8.56176E3|'whirs radiation ...|'vichies resituat...|'unreels voicer a...|             594|             434|                null|'hyperbolas knout...|              -1|\n",
      "|            'ahchoo'|'chanceman ventra...|http://example.co...|3.03146E3|'whirs radiation ...|'vichies resituat...|'unreels voicer a...|             594|             434|                null|'hyperbolas knout...|              -1|\n",
      "|'vacillator morti...|'workaholics situ...|http://example.co...|8.35118E3|'egoisms welterwe...|'unacceptance ant...|'steeper aerifies...|             834|             450|                null|                null|             202|\n",
      "|'desolates waging...|'poleward sagest ...|http://example.co...|9.54292E3|'catarrhs triadis...|'chilblains inter...|'digged glockensp...|             374|             536|'limeades iteranc...|                null|             813|\n",
      "|  'tither pettiness'|'buskin recompens...|http://example.co...|7.09958E3|'solidest incarna...|'builders preadju...|'dermatologies fl...|            1900|             774|                null|                null|              -1|\n",
      "|  'tither pettiness'|'buskin recompens...|http://example.co...|7.15571E3|'solidest incarna...|'builders preadju...|'dermatologies fl...|            1900|             774|                null|                null|              -1|\n",
      "|            'ahchoo'|'chanceman ventra...|http://example.co...|6.80574E3|'whirs radiation ...|'vichies resituat...|'unreels voicer a...|             594|             434|                null|'hyperbolas knout...|              -1|\n",
      "|            'ahchoo'|'chanceman ventra...|http://example.co...|1.66327E3|'whirs radiation ...|'vichies resituat...|'unreels voicer a...|             594|             434|                null|'hyperbolas knout...|              -1|\n",
      "|'resettling uncoa...|'reprice renovati...|http://example.co...|6.17836E3|'unrestored kneel...|'replicates corks...|'cowiest crimpers...|            1743|             136|                null|                null|              -1|\n",
      "|'desolates waging...|'poleward sagest ...|http://example.co...|2.12528E3|'catarrhs triadis...|'chilblains inter...|'digged glockensp...|             374|             536|'limeades iteranc...|                null|             813|\n",
      "|'reexhibit wrang ...|'bihourly prosies...|http://example.co...|5.76202E3|'skinfuls uncerta...|'quartered mishmo...|'visas deprecatin...|             940|             290|                null|                null|              -1|\n",
      "|  'tither pettiness'|'buskin recompens...|http://example.co...|7.57405E3|'solidest incarna...|'builders preadju...|'dermatologies fl...|            1900|             774|                null|                null|              -1|\n",
      "|'resettling uncoa...|'reprice renovati...|http://example.co...| 2.0237E3|'unrestored kneel...|'replicates corks...|'cowiest crimpers...|            1743|             136|                null|                null|              -1|\n",
      "|'reexhibit wrang ...|'bihourly prosies...|http://example.co...|3.27071E3|'skinfuls uncerta...|'quartered mishmo...|'visas deprecatin...|             940|             290|                null|                null|              -1|\n",
      "|'desolates waging...|'poleward sagest ...|http://example.co...|1.23598E3|'catarrhs triadis...|'chilblains inter...|'digged glockensp...|             374|             536|'limeades iteranc...|                null|             813|\n",
      "|'vacillator morti...|'workaholics situ...|http://example.co...|2.23648E3|'egoisms welterwe...|'unacceptance ant...|'steeper aerifies...|             834|             450|                null|                null|             202|\n",
      "|'desolates waging...|'poleward sagest ...|http://example.co...|6.82051E3|'catarrhs triadis...|'chilblains inter...|'digged glockensp...|             374|             536|'limeades iteranc...|                null|             813|\n",
      "|'desolates waging...|'poleward sagest ...|http://example.co...|7.84708E3|'catarrhs triadis...|'chilblains inter...|'digged glockensp...|             374|             536|'limeades iteranc...|                null|             813|\n",
      "|'resettling uncoa...|'reprice renovati...|http://example.co...|9.90447E3|'unrestored kneel...|'replicates corks...|'cowiest crimpers...|            1743|             136|                null|                null|              -1|\n",
      "|'desolates waging...|'poleward sagest ...|http://example.co...| 3.9302E2|'catarrhs triadis...|'chilblains inter...|'digged glockensp...|             374|             536|'limeades iteranc...|                null|             813|\n",
      "+--------------------+--------------------+--------------------+---------+--------------------+--------------------+--------------------+----------------+----------------+--------------------+--------------------+----------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?label ?comment ?producer ?price\n",
    "            ?propertyTextual1 ?propertyTextual2 ?propertyTextual3\n",
    "            ?propertyNumeric1 ?propertyNumeric2 ?propertyTextual4\n",
    "            ?propertyTextual5 ?propertyNumeric4\n",
    "        WHERE {\n",
    "            ?p rdfs:label ?label .\n",
    "            ?p rdfs:comment ?comment .\n",
    "            ?p bsbm:producer ?producer .\n",
    "            ?p dc:publisher ?ps .\n",
    "            ?offer bsbm:product ?p .\n",
    "            ?offer bsbm:price ?price .\n",
    "            ?p bsbm:productPropertyTextual1 ?propertyTextual1 .\n",
    "            ?p bsbm:productPropertyTextual2 ?propertyTextual2 .\n",
    "            ?p bsbm:productPropertyTextual3 ?propertyTextual3 .\n",
    "            ?p bsbm:productPropertyNumeric1 ?propertyNumeric1 .\n",
    "            ?p bsbm:productPropertyNumeric2 ?propertyNumeric2 .\n",
    "            ?p bsbm:productPropertyTextual4 ?propertyTextual4 .\n",
    "            ?p bsbm:productPropertyTextual5 ?propertyTextual5 .\n",
    "            ?p bsbm:productPropertyNumeric4 ?propertyNumeric4 .\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "resultDF.show()  # Plot the results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.4152048689993535, 1.3532676089998859, 1.281841459000134, 1.3187303929998961, 1.2268315700002859, 1.1259463480000704, 1.0925609179994353, 1.090250668000408, 1.092925513999944, 1.0814043720001791]\n",
      "\n",
      "AVG_TIME\n",
      "1.2078963719999591\n"
     ]
    }
   ],
   "source": [
    "# Runt the test\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?product ?label ?p1 ?p3\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?product bsbm:productPropertyNumeric1 ?p1 .\n",
    "            ?product bsbm:productPropertyNumeric3 ?p3 .\n",
    "            FILTER (?p1 > 1800)\n",
    "            FILTER (?p3 < 5 )\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-------+-----+---+---+\n",
      "|product|label| p1| p3|\n",
      "+-------+-----+---+---+\n",
      "+-------+-----+---+---+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?product ?label ?p1 ?p3\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?product bsbm:productPropertyNumeric1 ?p1 .\n",
    "            ?product bsbm:productPropertyNumeric3 ?p3 .\n",
    "            FILTER (?p1 > 1800)\n",
    "            FILTER (?p3 < 5 )\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "resultDF.show()  # Plot the results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.6409293859996978, 1.5143511790001867, 1.4720671129998664, 1.4853957100003754, 1.5623859620000076, 1.466603200999998, 1.8230932810001832, 1.6267371320000166, 1.9787561120001556, 1.4888913079994381]\n",
      "\n",
      "AVG_TIME\n",
      "1.6059210383999925\n"
     ]
    }
   ],
   "source": [
    "# Runt the test\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?label ?c ?propertyTextual ?p1\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:producer ?pcr .\n",
    "            ?pcr edm:country ?c .\n",
    "            ?pcr foaf:homepage ?h .\n",
    "            ?offer gr:validFrom ?vf .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rev:reviewer ?pers .\n",
    "            ?pers foaf:name ?fn .\n",
    "            ?pers edm:country ?cn .\n",
    "            ?product bsbm:productPropertyTextual1 ?propertyTextual .\n",
    "            ?product bsbm:productPropertyNumeric1 ?p1 .\n",
    "            FILTER (?p1 > 630)\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+---+--------------------+----+\n",
      "|               label|  c|     propertyTextual|  p1|\n",
      "+--------------------+---+--------------------+----+\n",
      "|           'coterie'| DE|'scalded decoct p...|1891|\n",
      "|    'manner gatemen'| DE|'guzzling jillion...| 831|\n",
      "|'procreators taiw...| DE|'exceptionally re...|1504|\n",
      "|'reexhibit wrang ...| DE|'skinfuls uncerta...| 940|\n",
      "|'resettling uncoa...| DE|'unrestored kneel...|1743|\n",
      "|  'tither pettiness'| DE|'solidest incarna...|1900|\n",
      "|'vacillator morti...| DE|'egoisms welterwe...| 834|\n",
      "+--------------------+---+--------------------+----+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?label ?c ?propertyTextual ?p1\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?label .\n",
    "            ?product bsbm:producer ?pcr .\n",
    "            ?pcr edm:country ?c .\n",
    "            ?pcr foaf:homepage ?h .\n",
    "            ?offer gr:validFrom ?vf .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rev:reviewer ?pers .\n",
    "            ?pers foaf:name ?fn .\n",
    "            ?pers edm:country ?cn .\n",
    "            ?product bsbm:productPropertyTextual1 ?propertyTextual .\n",
    "            ?product bsbm:productPropertyNumeric1 ?p1 .\n",
    "            FILTER (?p1 > 630)\n",
    "        }\n",
    "        ORDER BY ?label\n",
    "        LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "resultDF.show()  # Plot the results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.2483313510001608, 1.1526907839997875, 1.2019185660001312, 1.353941381000368, 1.284430734000125, 1.3256043119999958, 1.3318785020001087, 1.2719816759999958, 1.2185669350001263, 1.1202651530002186]\n",
      "\n",
      "AVG_TIME\n",
      "1.2509609394001018\n"
     ]
    }
   ],
   "source": [
    "# Runt the test\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?productLabel ?simProperty1 ?simProperty2\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?productLabel .\n",
    "            ?product bsbm:productPropertyNumeric1 ?simProperty1 .\n",
    "            ?product bsbm:productPropertyNumeric2 ?simProperty2 .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer rdf:type schema:Offer .\n",
    "            FILTER (?simProperty1 < 120)\n",
    "            FILTER (?productLabel != \"wineskins banded crc\")\n",
    "            FILTER (?simProperty2 < 170)\n",
    "        }\n",
    "        ORDER BY ?productLabel\n",
    "        LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+------------+------------+------------+\n",
      "|productLabel|simProperty1|simProperty2|\n",
      "+------------+------------+------------+\n",
      "+------------+------------+------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?productLabel ?simProperty1 ?simProperty2\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?productLabel .\n",
    "            ?product bsbm:productPropertyNumeric1 ?simProperty1 .\n",
    "            ?product bsbm:productPropertyNumeric2 ?simProperty2 .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rdf:type schema:Review .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer rdf:type schema:Offer .\n",
    "            FILTER (?simProperty1 < 120)\n",
    "            FILTER (?productLabel != \"wineskins banded crc\")\n",
    "            FILTER (?simProperty2 < 170)\n",
    "        }\n",
    "        ORDER BY ?productLabel\n",
    "        LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "resultDF.show()  # Plot the results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[1.5661725010004375, 1.4059532190003665, 1.6518069370004014, 1.687647785000081, 1.45523542599949, 1.4921913809994294, 1.4307240300004196, 1.4425667409996095, 1.4473819140002888, 1.3965456289997746]\n",
      "\n",
      "AVG_TIME\n",
      "1.4976225563000298\n"
     ]
    }
   ],
   "source": [
    "# Runt the test\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?productLabel ?price ?vendor ?revTitle\n",
    "        ?reviewer ?rating1 ?rating2 ?product ?revName\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?productLabel .\n",
    "            ?product rdf:type bsbm:Product .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer bsbm:price ?price .\n",
    "            ?offer bsbm:vendor ?vendor .\n",
    "            ?offer bsbm:validTo ?date .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rev:reviewer ?reviewer .\n",
    "            ?review dc:title ?revTitle .\n",
    "            ?review bsbm:rating1 ?rating1 .\n",
    "            ?review bsbm:rating2 ?rating2 .\n",
    "            ?reviewer foaf:name ?revName .\n",
    "            ?reviewer a foaf:Person .\n",
    "            FILTER (?price > 5000)\n",
    "            FILTER (str(?product) = \"http://example.com/Product/9\")\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+---------+------+--------------------+--------------------+-------+-------+--------------------+--------------------+\n",
      "|        productLabel|    price|vendor|            revTitle|            reviewer|rating1|rating2|             product|             revName|\n",
      "+--------------------+---------+------+--------------------+--------------------+-------+-------+--------------------+--------------------+\n",
      "|'procreators taiw...|8.09271E3|     1|'improves pervert...|http://example.co...|      7|     10|http://example.co...|'Danijela-Adalbrand'|\n",
      "|'procreators taiw...|9.23612E3|     1|'improves pervert...|http://example.co...|      7|     10|http://example.co...|'Danijela-Adalbrand'|\n",
      "|'procreators taiw...|7.26904E3|     1|'slavishness muon...|http://example.co...|      5|     10|http://example.co...|  'Eyana-Aurelianus'|\n",
      "|'procreators taiw...|9.23612E3|     1|'slavishness muon...|http://example.co...|      5|     10|http://example.co...|  'Eyana-Aurelianus'|\n",
      "|'procreators taiw...|9.23612E3|     1|'recharting wardr...|http://example.co...|     -1|      4|http://example.co...|'Danijela-Adalbrand'|\n",
      "|'procreators taiw...|8.72534E3|     1|'heehawed underwa...|http://example.co...|     -1|      4|http://example.co...|'Danijela-Adalbrand'|\n",
      "|'procreators taiw...|6.95779E3|     1|'footworn forms n...|http://example.co...|      8|      5|http://example.co...|     'Przemek-Berte'|\n",
      "|'procreators taiw...|8.72534E3|     1|'slavishness muon...|http://example.co...|      5|     10|http://example.co...|  'Eyana-Aurelianus'|\n",
      "|'procreators taiw...|9.23612E3|     1|'footworn forms n...|http://example.co...|      8|      5|http://example.co...|     'Przemek-Berte'|\n",
      "|'procreators taiw...|8.72534E3|     1|'improves pervert...|http://example.co...|      7|     10|http://example.co...|'Danijela-Adalbrand'|\n",
      "|'procreators taiw...|8.72534E3|     1|'affirmance subag...|http://example.co...|      2|      3|http://example.co...|  'Allegra-Walburga'|\n",
      "|'procreators taiw...|7.26904E3|     1|'improves pervert...|http://example.co...|      7|     10|http://example.co...|'Danijela-Adalbrand'|\n",
      "|'procreators taiw...|9.23612E3|     1|'affirmance subag...|http://example.co...|      2|      3|http://example.co...|  'Allegra-Walburga'|\n",
      "|'procreators taiw...|8.09271E3|     1|'slavishness muon...|http://example.co...|      5|     10|http://example.co...|  'Eyana-Aurelianus'|\n",
      "|'procreators taiw...|6.95779E3|     1|'affirmance subag...|http://example.co...|      2|      3|http://example.co...|  'Allegra-Walburga'|\n",
      "|'procreators taiw...|6.95779E3|     1|'heehawed underwa...|http://example.co...|     -1|      4|http://example.co...|'Danijela-Adalbrand'|\n",
      "|'procreators taiw...|8.72534E3|     1|'recharting wardr...|http://example.co...|     -1|      4|http://example.co...|'Danijela-Adalbrand'|\n",
      "|'procreators taiw...|7.26904E3|     1|'footworn forms n...|http://example.co...|      8|      5|http://example.co...|     'Przemek-Berte'|\n",
      "|'procreators taiw...|8.09271E3|     1|'heehawed underwa...|http://example.co...|     -1|      4|http://example.co...|'Danijela-Adalbrand'|\n",
      "|'procreators taiw...|7.26904E3|     1|'recharting wardr...|http://example.co...|     -1|      4|http://example.co...|'Danijela-Adalbrand'|\n",
      "+--------------------+---------+------+--------------------+--------------------+-------+-------+--------------------+--------------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT ?productLabel ?price ?vendor ?revTitle\n",
    "        ?reviewer ?rating1 ?rating2 ?product ?revName\n",
    "        WHERE {\n",
    "            ?product rdfs:label ?productLabel .\n",
    "            ?product rdf:type bsbm:Product .\n",
    "            ?offer bsbm:product ?product .\n",
    "            ?offer bsbm:price ?price .\n",
    "            ?offer bsbm:vendor ?vendor .\n",
    "            ?offer bsbm:validTo ?date .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review rev:reviewer ?reviewer .\n",
    "            ?review dc:title ?revTitle .\n",
    "            ?review bsbm:rating1 ?rating1 .\n",
    "            ?review bsbm:rating2 ?rating2 .\n",
    "            ?reviewer foaf:name ?revName .\n",
    "            ?reviewer a foaf:Person .\n",
    "            FILTER (?price > 5000)\n",
    "            FILTER (str(?product) = \"http://example.com/Product/9\")\n",
    "        }\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "resultDF.show()  # Plot the results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q8"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TIME\n",
      "[2.0529662589997315, 1.926983907000249, 2.010208208000222, 1.6466033329998027, 2.0347125990001587, 1.650691179000205, 1.7891909820000365, 1.6625204680003662, 1.6934222979998594, 1.6864905579996048]\n",
      "\n",
      "AVG_TIME\n",
      "1.8153789791000237\n"
     ]
    }
   ],
   "source": [
    "# Runt the test\n",
    "\n",
    "code ='''\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?title ?text ?reviewDate ?reviewer\n",
    "                        ?reviewerName ?rating1 ?rating2\n",
    "                        ?rating3 ?rating4 ?product\n",
    "        WHERE {\n",
    "            ?product rdfs:label  ?label .\n",
    "            ?product bsbm:productPropertyTextual1 ?pt .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?producer edm:country ?c .\n",
    "            ?producer foaf:homepage ?h .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review dc:title ?title .\n",
    "            ?review rev:text ?text .\n",
    "            ?review bsbm:reviewDate ?reviewDate .\n",
    "            ?review rev:reviewer ?reviewer .\n",
    "            ?review bsbm:rating1 ?rating1 .\n",
    "            ?review bsbm:rating2 ?rating2 .\n",
    "            ?review bsbm:rating3 ?rating3 .\n",
    "            ?review bsbm:rating4 ?rating4 .\n",
    "            ?reviewer foaf:name ?reviewerName .\n",
    "            ?reviewer a foaf:Person .\n",
    "            FILTER (str(?product) = \"http://example.com/Product/9\")\n",
    "        }\n",
    "        ORDER BY DESC(?reviewDate)\n",
    "        LIMIT 9\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "'''\n",
    "\n",
    "result = timeit.repeat(code, repeat=repeat, globals=globals() , number=loop)\n",
    "\n",
    "print(\"TIME\")\n",
    "print(result)\n",
    "\n",
    "print(\"\\nAVG_TIME\")\n",
    "print(Average(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+--------------------+----------+--------------------+--------------------+-------+-------+-------+-------+--------------------+\n",
      "|               title|                text|reviewDate|            reviewer|        reviewerName|rating1|rating2|rating3|rating4|             product|\n",
      "+--------------------+--------------------+----------+--------------------+--------------------+-------+-------+-------+-------+--------------------+\n",
      "|'heehawed underwa...|'brisker astrophy...|2008-03-23|http://example.co...|'Danijela-Adalbrand'|     -1|      4|     -1|      9|http://example.co...|\n",
      "|'affirmance subag...|'southwesterners ...|2008-01-16|http://example.co...|  'Allegra-Walburga'|      2|      3|     10|      6|http://example.co...|\n",
      "|'slavishness muon...|'philatelist lugu...|2008-01-14|http://example.co...|  'Eyana-Aurelianus'|      5|     10|     -1|     -1|http://example.co...|\n",
      "|'footworn forms n...|'breedings silenc...|2007-12-04|http://example.co...|     'Przemek-Berte'|      8|      5|      2|      1|http://example.co...|\n",
      "|'recharting wardr...|'moxas clangored ...|2007-11-16|http://example.co...|'Danijela-Adalbrand'|     -1|      4|      7|     10|http://example.co...|\n",
      "|'improves pervert...|'mapping construc...|2007-11-16|http://example.co...|'Danijela-Adalbrand'|      7|     10|      2|      8|http://example.co...|\n",
      "+--------------------+--------------------+----------+--------------------+--------------------+-------+-------+-------+-------+--------------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Run the query\n",
    "\n",
    "query = \"\"\"\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX schema: <http://schema.org/>\n",
    "        PREFIX rev: <http://purl.org/stuff/rev#>\n",
    "        PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "        PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "        PREFIX gr: <http://purl.org/goodrelations/v1#>\n",
    "        PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX bsbm: <http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/>\n",
    "\n",
    "        SELECT DISTINCT ?title ?text ?reviewDate ?reviewer\n",
    "                        ?reviewerName ?rating1 ?rating2\n",
    "                        ?rating3 ?rating4 ?product\n",
    "        WHERE {\n",
    "            ?product rdfs:label  ?label .\n",
    "            ?product bsbm:productPropertyTextual1 ?pt .\n",
    "            ?product bsbm:producer ?producer .\n",
    "            ?producer edm:country ?c .\n",
    "            ?producer foaf:homepage ?h .\n",
    "            ?review bsbm:reviewFor ?product .\n",
    "            ?review dc:title ?title .\n",
    "            ?review rev:text ?text .\n",
    "            ?review bsbm:reviewDate ?reviewDate .\n",
    "            ?review rev:reviewer ?reviewer .\n",
    "            ?review bsbm:rating1 ?rating1 .\n",
    "            ?review bsbm:rating2 ?rating2 .\n",
    "            ?review bsbm:rating3 ?rating3 .\n",
    "            ?review bsbm:rating4 ?rating4 .\n",
    "            ?reviewer foaf:name ?reviewerName .\n",
    "            ?reviewer a foaf:Person .\n",
    "            FILTER (str(?product) = \"http://example.com/Product/9\")\n",
    "        }\n",
    "        ORDER BY DESC(?reviewDate)\n",
    "        LIMIT 9\n",
    "\"\"\"\n",
    "\n",
    "wrapper = PySPARQLWrapper(spark, sparql_endpoint)\n",
    "result = wrapper.query(query)\n",
    "resultDF = result.dataFrame\n",
    "\n",
    "resultDF.show()  # Plot the results"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
